# St7SetResFileTime

Sets the integration time for the specified result case in the custom result file; units are seconds.

long St7SetResFileTime(long uID, long CaseNum, double Time)
Input Parameters
uID
Strand7 model file ID.
CaseNum
Result case number.
Time
Integration time in seconds.